docs/inclass05A.org
#+TITLE: SWE 619 In Class Exercise Number 5A

#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">

* Instructions

  *Goal*: Understanding dynamic dispatching

  Consider Liskov's =MaxIntSet= example with explict =repOk()= calls: (Really, we'd need assertions on these calls...)

  #+begin_src java

    public class IntSet {
        public void insert(int x) {...; repOk();}
        public void remove(int x) {...; repOk();}
        public boolean repOk() {...}
    }
    public class MaxIntSet extends IntSet {
        public void insert(int x) {...; super.insert(x); repOk();}
        public void remove(int x) {super.remove(x); ...; repOk();}
        public boolean repOk() {super.repOk(); ...;}
    }

    MaxIntSet s = {3, 5}; s.remove(5);  // repOk()????
  #+end_src
  
  1. What does the default constructor in =MaxIntSet= do?
  1. What do the ="..."= bits do?
  1. How does the call work out?
  1. What is the abstract state of a =MaxIntSet=? There are two options. What are they, and what are the consequences of each choice? 


* Links
  - [[./index.html][Syllabus]]
  - [[./schedule.html][Schedule]]

