docs/inclass05A.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-10 Sat 21:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 In Class Exercise Number 5A</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 In Class Exercise Number 5A</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org68fb30a">1. Instructions</a></li>
<li><a href="#org28f76dc">2. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org68fb30a" class="outline-2">
<h2 id="org68fb30a"><span class="section-number-2">1</span> Instructions</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Goal</b>: Understanding dynamic dispatching
</p>

<p>
Consider Liskov's <code>MaxIntSet</code> example with explict <code>repOk()</code> calls: (Really, we'd need assertions on these calls&#x2026;)
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">IntSet</span> {
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">insert</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x</span>) {...; repOk();}
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">remove</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x</span>) {...; repOk();}
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">repOk</span>() {...}
}
<span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">MaxIntSet</span> <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">IntSet</span> {
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">insert</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x</span>) {...; <span style="color: #51afef;">super</span>.insert(x); repOk();}
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">remove</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x</span>) {<span style="color: #51afef;">super</span>.remove(x); ...; repOk();}
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">repOk</span>() {<span style="color: #51afef;">super</span>.repOk(); ...;}
}

<span style="color: #ECBE7B;">MaxIntSet</span> <span style="color: #dcaeea;">s</span> = {3, 5}; s.remove(5);  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">repOk()????</span>
</pre>
</div>

<ol class="org-ol">
<li>What does the default constructor in <code>MaxIntSet</code> do?</li>
<li>What do the <code>"..."</code> bits do?</li>
<li>How does the call work out?</li>
<li>What is the abstract state of a <code>MaxIntSet</code>? There are two options. What are they, and what are the consequences of each choice?</li>
</ol>
</div>
</div>


<div id="outline-container-org28f76dc" class="outline-2">
<h2 id="org28f76dc"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
